
## Plan Result (stg)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * module.opal_postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
* Replace
  * module.application_insights.azurerm_monitor_activity_log_alert.main[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.application_insights.azurerm_monitor_activity_log_alert.main[0] must be replaced
-/+ resource "azurerm_monitor_activity_log_alert" "main" {
      ~ id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-stg/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached - opal-stg" -> (known after apply)
      ~ name                = "Application Insights daily cap reached - opal-stg" -> "Application-Insights-daily-cap-reached-opal-stg" # forces replacement
        tags                = {
            "application"         = "opal"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/opal-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#opal-help"
            "environment"         = "staging"
            "managedBy"           = "Green on Black"
        }
        # (5 unchanged attributes hidden)

      ~ criteria {
          - levels                  = [] -> null
          - resource_groups         = [] -> null
          - resource_ids            = [] -> null
          - resource_providers      = [] -> null
          - resource_types          = [] -> null
          - statuses                = [] -> null
          - sub_statuses            = [] -> null
            # (13 unchanged attributes hidden)

          ~ resource_health {
              + caller                  = (known after apply)
              + category                = (known after apply)
              + level                   = (known after apply)
              + levels                  = (known after apply)
              + operation_name          = (known after apply)
              + recommendation_category = (known after apply)
              + recommendation_impact   = (known after apply)
              + recommendation_type     = (known after apply)
              + resource_group          = (known after apply)
              + resource_groups         = (known after apply)
              + resource_id             = (known after apply)
              + resource_ids            = (known after apply)
              + resource_provider       = (known after apply)
              + resource_providers      = (known after apply)
              + resource_type           = (known after apply)
              + resource_types          = (known after apply)
              + status                  = (known after apply)
              + statuses                = (known after apply)
              + sub_status              = (known after apply)
              + sub_statuses            = (known after apply)
            } -> (known after apply)

          ~ service_health {
              + caller                  = (known after apply)
              + category                = (known after apply)
              + level                   = (known after apply)
              + levels                  = (known after apply)
              + operation_name          = (known after apply)
              + recommendation_category = (known after apply)
              + recommendation_impact   = (known after apply)
              + recommendation_type     = (known after apply)
              + resource_group          = (known after apply)
              + resource_groups         = (known after apply)
              + resource_id             = (known after apply)
              + resource_ids            = (known after apply)
              + resource_provider       = (known after apply)
              + resource_providers      = (known after apply)
              + resource_type           = (known after apply)
              + resource_types          = (known after apply)
              + status                  = (known after apply)
              + statuses                = (known after apply)
              + sub_status              = (known after apply)
              + sub_statuses            = (known after apply)
            } -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # module.opal_postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_name      = "DTS Platform Operations"
      + principal_type      = "Group"
      + resource_group_name = "opal-db-data-stg"
      + server_name         = "opal-db-stg"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":24,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->